Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.Add Method (AnalysisPosition)
 Adds a position to the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	AnalysisPosition AnalysisPosition
)
Public Sub Add (
	AnalysisPosition As AnalysisPosition
)
Parameters
AnalysisPosition
Type: Tekla.Structures.Analysis.AnalysisPosition
The position to be added.
See Also
Reference
AnalysisBar Class
Add Overload
Tekla.Structures.Analysis Namespace